app/views/users/tasks/index.html.erb

SELECT "tasks".* FROM "tasks"
---
  </div>
  <% unless task.sub_tasks.empty? %>