app/controllers/users/graphs_controller.rb

	def show
		@user = current_user
		@tasks = Task.where(important_status: 1,)
		p @tasks.count
		@tasks = Task.where(important_status: 2,)
		p @tasks.count
		@tasks = Task.where(important_status: 3,)
		p @tasks.count
		@tasks = Task.where(important_status: 4,)
		p @tasks.count
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."important_status" = ?  [["important_status", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."important_status" = ?  [["important_status", 2]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."important_status" = ?  [["important_status", 3]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."important_status" = ?  [["important_status", 4]]