app/controllers/users/tasks_controller.rb

INSERT INTO "tasks" ("memo", "important_status", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["memo", ""], ["important_status", 1], ["title", "test"], ["user_id", 1], ["created_at", "2020-03-18 11:41:55.257045"], ["updated_at", "2020-03-18 11:41:55.257045"]]
---
	def create
		@task = Task.new(task_params)
		@task.user_id = current_user.id

		if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "start_date_time" = ?, "end_date_time" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["start_date_time", "2020-03-19 13:24:00"], ["end_date_time", "2020-04-01 13:21:00"], ["updated_at", "2020-03-19 04:21:36.603031"], ["id", 1]]
---
	def update
		@task = Task.find(params[:id])

		@task.update!(task_params)