app/controllers/users/users_controller.rb

	def update
		@user = User.find(params[:id])
		@user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "岡本敏嗣"], ["updated_at", "2020-03-11 09:03:36.623084"], ["id", 1]]